       IDENTIFICATION DIVISION.
       PROGRAM-ID. FEEMODULE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 FEE-PERCENTAGE PIC 9(2)V99.
       01 FEE-SALARY PIC 9(5).
       01 BIRTHYEAR PIC 9(8).

        COPY "FEE_TABLE.CPY".
           EXEC SQL
             INCLUDE SQLCA
           END-EXEC.

       LINKAGE SECTION.
       01 WS-DATEOFBIRTH PIC 9(8).
       01 WS-SALARY PIC 9(5).
       01 WS-FEE PIC 9(5).

       PROCEDURE DIVISION USING WS-SALARY
                                WS-DATEOFBIRTH
                                WS-FEE.

           MOVE WS-SALARY TO FEE-SALARY
           MOVE WS-DATEOFBIRTH TO BIRTHYEAR

           EXEC SQL
               SELECT FEE_PERCENTAGE
               INTO :FEE-PERCENTAGE
               FROM REDWARRIOR.dbo.FEE_TABLE
               WHERE :BIRTHYEAR BETWEEN MIN_BIRTHYEAR AND MAX_BIRTHYEAR
           END-EXEC.

           IF SQLCODE NOT = 0
               MOVE 0 TO FEE-PERCENTAGE
           END-IF.

           COMPUTE WS-FEE = FEE-SALARY * FEE-PERCENTAGE
           GOBACK.