       01 CSV-EMPLOYEE.
         05 CSV-EMPLOYEE-ROW OCCURS 20 TIMES.
           10 CSV-EMPLOYEE-FIRST-NAME PIC X(20).
           10 CSV-EMPLOYEE-LAST-NAME PIC X(20).
           10 CSV-EMPLOYEE-DATEOFBIRTH PIC 9(8).
           10 CSV-FEE PIC 9(5).
