       01 EMPLOYEE.
         05 EMPLOYEE-ROW OCCURS 20 TIMES.
           10 EMPLOYEE-FIRST-NAME PIC X(20).
           10 EMPLOYEE-LAST-NAME PIC X(20).
           10 EMPLOYEE-DATEOFBIRTH PIC 9(8).
           10 EMPLOYEE-SALARY PIC 9(5).
           10 EMPLOYEE-CHURCH PIC X.
