       01 JSON-EMPLOYEE.
         05 JSON-EMPLOYEE-ROW OCCURS 20 TIMES.
           10 JSON-EMPLOYEE-FIRST-NAME PIC X(20).
           10 JSON-EMPLOYEE-LAST-NAME PIC X(20).
           10 JSON-EMPLOYEE-DATEOFBIRTH PIC 9(8).
           10 JSON-TAX-AMOUNT PIC 9(5).
        
