       01 CSV-SCREEN-EMPLOYEE.
         05 CSV-SCREEN-ROW OCCURS 20 TIMES.
           10 CSV-SCREEN-FIRST-NAME PIC X(20).
           10 CSV-SCREEN-LAST-NAME PIC X(20).
           10 CSV-SCREEN-DATEOFBIRTH PIC 9(8).
           10 CSV-SCREEN-FEE PIC 9(5).
