       01 XML-EMPLOYEE.
         05 XML-EMPLOYEE-ROW OCCURS 20 TIMES.
           10 XML-EMPLOYEE-FIRST-NAME PIC X(20).
           10 XML-EMPLOYEE-LAST-NAME PIC X(20).
           10 XML-EMPLOYEE-DATEOFBIRTH PIC 9(8).
           10 XML-SALARY PIC 9(5).
